app/views/carts/show.html.erb

SELECT "orderitems".* FROM "orderitems" WHERE "orderitems"."cart_id" = ?  [["cart_id", 1]]
---
  <tbody>
    <%  @cart.orderitems.each do |item| %>