app/controllers/carts_controller.rb

  def destroy
    if @cart.id = session[:cart_id]
    @cart.destroy
---
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 14]]