app/controllers/orders_controller.rb

SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-04-23 20:54:02.068790"], ["updated_at", "2018-04-23 20:54:02.068790"]]
---
    def set_cart
        @cart = Cart.find_by_id(session[:cart_id])
        #rescue ActiveRecord::RecordNotFound
        if @cart==nil
        @cart=Cart.create

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
   # @order=Order.find_by_user_id(current_user.id)
    @order = Order.find(session[:order_id])

INSERT INTO "orders" ("user_id", "salesTax", "shippingFee", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["salesTax", 13.5], ["shippingFee", 20.0], ["total", 800.0], ["created_at", "2018-04-23 16:39:16.922693"], ["updated_at", "2018-04-23 16:39:16.922693"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 2]]
---
  def create
    @order = Order.new(order_params)

    #@order.cart_id = @cart.id
    @order.user_id = current_user.id #session[:user_id]
    @order.add_orderitems(@cart)
    @order.total = @cart.cart_total
    respond_to do |format|
      if @order.save
        #need to check below line
        session[:order_id]=@order.id
        Cart.destroy(session[:cart_id])