app/controllers/orderitems_controller.rb

   def set_cart
        @cart = Cart.find_by_id(session[:cart_id])
        #rescue ActiveRecord::RecordNotFound
        if @cart==nil
        @cart=Cart.create
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-04-16 17:28:07.165516"], ["updated_at", "2018-04-16 17:28:07.165516"]]

  def index
    @orderitems = Orderitem.all
---
SELECT "orderitems".* FROM "orderitems"

  def create
     product = Product.find(params[:id])
   # @orderitem = @cart.orderitems.build(product: product)
      @orderitem = @cart.add_product(product)

    respond_to do |format|
      if
        @orderitem.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "orderitems" ("product_id", "quantity", "subtotal", "created_at", "updated_at", "cart_id") VALUES (?, ?, ?, ?, ?, ?)  [["product_id", 1], ["quantity", 1], ["subtotal", 1000.0], ["created_at", "2018-04-16 17:28:19.872400"], ["updated_at", "2018-04-16 17:28:19.872400"], ["cart_id", 2]]
UPDATE "orderitems" SET "quantity" = ?, "subtotal" = ?, "updated_at" = ? WHERE "orderitems"."id" = ?  [["quantity", 2], ["subtotal", 2000.0], ["updated_at", "2018-04-17 17:36:05.882743"], ["id", 2]]

  def destroy
    @orderitem.destroy
---
DELETE FROM "orderitems" WHERE "orderitems"."id" = ?  [["id", 64]]

    def set_orderitem
      @orderitem = Orderitem.find(params[:id])
---
SELECT  "orderitems".* FROM "orderitems" WHERE "orderitems"."id" = ? LIMIT ?  [["id", 64], ["LIMIT", 1]]