app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (:Manu)
---
  def showbymanu
    #man="Hp"#params[:Manu]
  @products=Product.where(params[:Manu])

SELECT "products".* FROM "products" WHERE (name LIKE '%HP%' OR manu LIKE '%HP%' OR procname LIKE '%HP%' OR desc LIKE '%HP%')
---
  def index
    @products = Product.all

INSERT INTO "products" ("name", "manu", "model", "desc", "procname", "memsize", "hdtype", "hdsize", "osname", "vatprice", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save