app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("fname", "lname", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "phone" = ?, "encrypted_password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["phone", "123456"], ["encrypted_password", "$2a$11$L5y8X/hJkh5yFGYXNLEac.P9lWPh77aAubenUpdyi1mJHz2PJNxdG"], ["updated_at", "2018-04-23 21:51:51.613154"], ["id", 11]]